# LoadAttrAreaForceScaleFactor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadAttrAreaForceScaleFactor Property
ParameterTypeId Class See Also
---
"Area force scale"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadAttrAreaForceScaleFactor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadAttrAreaForceScaleFactor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadAttrAreaForceScaleFactor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace